samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
/**
 * @file freertos_test.c
 * 
 * @author Sam Donnelly (samueldonnelly11@gmail.com)
 * 
 * @brief FreeRTOS practice implementation 
 * 
 * @details The examples/tests implemented here are from the "Introduction to RTOS" video 
 *          playlist by DigiKey: 
 *          https://www.youtube.com/playlist?list=PLEBQazB0HUyQ4hAPU1cJED6t3DU0h34bz 
 * 
 * @version 0.1
 * @date 2024-02-20
 * 
 * @copyright Copyright (c) 2024
 * 
 */

//=======================================================================================
// Includes 

#include "freertos_test.h" 
#include "includes_drivers.h" 
#include "stm32f4xx_it.h" 

#include "FreeRTOS.h"
#include "task.h"
#include "cmsis_os2.h"
#include "queue.h" 
#include "semphr.h" 
#include "timers.h" 

//=======================================================================================


//=======================================================================================
// Macros 

// Conditional compilation 
#define PERIODIC_BLINK_TEST 0        // Highest priority 
#define MANUAL_BLINK_TEST 0 
#define TASK_SCHEDULING_TEST 0 
#define MEMORY_MANAGEMENT_TEST 0 
#define QUEUE_TEST 0 
#define MUTEX_TEST 0 
#define SEMAPHORE_TEST 0 
#define SOFTWARE_TIMER_TEST_0 0 
#define SOFTWARE_TIMER_TEST_1 0 
#define HARDWARE_INTERRUPT_TEST 0 
#define DEADLOCK_STARVATION_TEST 1 
#define PRIORITY_INVERSION_TEST 0    // Lowest priority 

// Memory 
#define MAIN_LOOP_STACK_SIZE configMINIMAL_STACK_SIZE * 8 

// Data 
#define SERIAL_INPUT_MAX_LEN 30 

//==================================================
// Periodic Blink (PB) Test 

// There are two tasks that both toggle the board LED but at different rates. While not 
// toggling the LED state, each task is put into the blocking state. The main loop task 
// does nothing here. 

// Memory 
#define PB_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Timing (number of ticks - default tick period is 1ms) 
#define PB_DELAY_1 500 
#define PB_DELAY_2 600 

//==================================================

//==================================================
// Manual Blink (MB) Test 

// There are two tasks used to control the blinking rate of an LED. The main loop task 
// will listen for user input on the serial terminal which indicates the blinking rate 
// of the LED (in ticks). If there is input then it will be read and converted to a 
// number and used to update the blink rate. The other task will toggle the LED state 
// at the rate set by the user input. 

// Memory 
#define MB_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define MB_MIN_LED_RATE 50 

//==================================================

//==================================================
// Task Scheduling (TS) Test 

// There are two tasks that both print to the serial terminal. The first task is of a 
// lower priority and prints an arbitrary string at every 1 second. The second task is 
// of a higher priority and prints an asterisks every 100 ms. The main loop task controls 
// both of these tasks by first periodically suspending task 2, then after this is done 
// a few times task 1 is deleted so that only task 2 remains running. The messages should 
// be printed at a slow baud rate to better observe the preemptive nature of the RTOS. 

// Memory 
#define TS_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Timing 
#define TS_DELAY_1 2000   // Ticks 
#define TS_DELAY_2 1000   // Ticks 
#define TS_DELAY_3 100    // Ticks 
#define TS_DELAY_4 5000   // (ms) 

//==================================================

//==================================================
// Memory Management (MM) Test 

// This test uses two tasks to mimic a serial echo program. One task listens and records 
// input from the serial terminal. Once the end of the input is seen (new line or 
// carriage return), all the input up to that point gets stored in allocated heap memory 
// and informs the second task that there is new data. The second task prints the input 
// message back to there terminal when it becomes available and frees the memory used to 
// store the message. 

// Memory 
#define MM_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define MM_STR_MAX_LEN 100 

//==================================================

//==================================================
// Queue Test 

// This test has two tasks and two queues. Task A will read serial terminal input from 
// the user and echo it back to the terminal, print new messages from queue 2 and if 
// "delay <value>" is input by the user then send <value> to queue 1. Task B will 
// update a variable with any new values from queue 1, use the value of this variable 
// to control the blink rate/delay of the board LED, and send the number of times the 
// LED has blinked 100 times to queue 2. 

// Memory 
#define QUEUE_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define QUEUE_MIN_LED_RATE 50 

//==================================================

//==================================================
// Mutex Test 

// There are two tasks that both increment the same counter using the same function call. 
// There is a mutex that prevents the other task from running while the current task 
// increments the counter. 

// Memory 
#define MUTEX_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Timing 
#define MUTEX_DELAY_1 1000   // Ticks 
#define MUTEX_DELAY_2 1500   // Ticks 

//==================================================

//==================================================
// Semaphore Test 

// There are 5 producer tasks that write to a circular buffer and 2 consumer tasks that 
// read from it. The producer tasks write their task number to the buffer 3 times and 
// the consumers print the contents of the buffer to the serial terminal. The serial 
// terminal output should display each task number exactly 3 times and have one number 
// output per line, meaning access to the buffer, the state of the buffer and the serial 
// line must be protected from multiple accesse. Protection is accomplished by a mutex 
// to protect the buffer and serial line as well as two counting semaphores, one for 
// the number of empty buffer slots and one for the number of full buffer slots, that 
// prevent overwriting and overreading the buffer. Each producer task should be created, 
// copy its task number passed as the task argument to a local variable, run once and 
// then deleted itself. 

// Memory 
#define SEMAPHORE_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define SEMAPHORE_NUM_PRODUCERS 5 
#define SEMAPHORE_NUM_CONSUMERS 2 
#define SEMAPHORE_NUM_WRITES 3 
#define SEMAPHORE_BUFF_SIZE 5 
#define SEMAPHORE_TASK_NAME_LEN 15 

