samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
// Timing 
#define SEMPAHORE_DELAY_1 5000   // (ms) 

//==================================================

//==================================================
// Software Timer Test 0 

// There are two software timers, one is a one-shot and the other is a repeat. Both 
// timers have the same callback function that will display which timer has expired 
// in the serial terminal. 

// Timing 
#define SOFTWARE_TIMER_0_DELAY_1 1000    // ms 
#define SOFTWARE_TIMER_0_PERIOD_1 1000   // Ticks 
#define SOFTWARE_TIMER_0_PERIOD_2 2000   // Ticks 

//==================================================

//==================================================
// Software Timer Test 1 

// Use the board LED to simulate a backlight display. When characters are entered in 
// the serial terminal (doesn't matter what), the LED lights up as if we're interfacing 
// with a screen menu. Turn the LED off after 5 second of no input (inactivity). Use a 
// software timer to accomplish this. Hint: xTimerStart will restart a counter if it's 
// called before the timer expires. 

// Memory 
#define SOFTWARE_TIMER_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Timing 
#define SOFTWARE_TIMER_1_DELAY_1 1000   // ms 
#define SOFTWARE_TIMER_1_DELAY_2 5      // ms
#define SOFTWARE_TIMER_1_PERIOD 5000    // ticks 

//==================================================

//==================================================
// Hardware Interrupts Test 

// Use a hardware timer (ISR) to sample an ADC 10 times per second (10 Hz) and store the 
// values in a double or circular buffer. A double or circular buffer is recommended so 
// data can be read/used at the same time new data gets written. Once 10 samples have 
// been collected, the ISR should wake up task A which computes the average of the 10 
// samples and stores the result in a global floating point variable. Assume this global 
// variable cannot be written to or read from in a single instruction cycle (critical 
// section). Task B will output the value of the global variable to the serial terminal 
// if "avg" is entered by the user, otherwise the input is ignored. 

// Memory 
#define HARDWARE_INT_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define HARDWARE_INT_NUM_SAMPLES 10 

//==================================================

//==================================================
// Deadlock and Starvation Test 

// "Dining Philosophers Problem" - based on video series 
// 5 philosophers at a table, 5 chopsticks available, one bowl of noodles. A chopstick 
// is placed in between each philosopher and a philosopher can only eat when they have 
// two chopsticks. The challenge is to find a logical way to make sure all philosophers 
// get to eat. 
// For this example, the philosophers are the tasks, the chopsticks are the semaphores 
// and mutexes, and the bowl of food is the shared resource. There are 5 tasks that all 
// call the same function which takes a left chopstick, then a right chopstick and "eats" 
// for a while (i.e. prints to the serial terminal). After it's done then the chopsticks 
// are put down and the function exits. If all philosophers get a chance to eat then a 
// "done" message will be printed to the serial terminal. To accomplish this, a hierarchy 
// solution or an arbitrator solution can be used: 
// - Hierarchy: A hierarchy (number) is assigned to the chopsticks and philosophers can 
//              pick up a chopstick next to them with the lowest number. This leaves one 
//              philosopher free to pick up two chopsticks and eat. Eventually the eating 
//              philosopher will put down the chopsticks and it will trigger a chain of 
//              eating. 
// - Arbitrator: A mutex that protects the chopsticks so only one philosopher can eat at 
//               a time. This makes the system no better than executing everything in a 
//               super loop but it's used for the sake of the problem. 

// Memory 
#define DEADLOCK_STARVATION_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Data 
#define NUM_PHILOSOPHERS 5 
#define DEADLOCK_STARVATION_TASK_NAME_LEN 15 
#define PHILOSOPHER_STR_MAX_LEN 50 

// Timing 
#define DEADLOCK_STARVATION_DELAY_1 5000   // (ms) 

//==================================================

//==================================================
// Priority Inversion Test 

// 

//==================================================

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: main loop 
osThreadId_t mainLoopHandle; 
const osThreadAttr_t main_loop_attributes = 
{
    .name = "main_loop", 
    .stack_size = MAIN_LOOP_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityLow   // Above Idle but below everything else 
}; 

// Serial terminal data 
static uint8_t uart_dma_buff[SERIAL_INPUT_MAX_LEN];   // Circular buffer 
static uint8_t buff_index;                            // Circular buffer index 
static uint8_t user_in_buff[SERIAL_INPUT_MAX_LEN];    // Stores latest user input 

#if PERIODIC_BLINK_TEST 

// Task definition: blink01 
osThreadId_t blink01Handle; 
const osThreadAttr_t blink01_attributes = 
{
    .name = "blink01", 
    .stack_size = PB_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Task definition: blink02 
osThreadId_t blink02Handle; 
const osThreadAttr_t blink02_attributes = 
{
    .name = "blink02",
    .stack_size = PB_STACK_SIZE,
    .priority = (osPriority_t) osPriorityBelowNormal 
};

// Board LED state - tasks will fight over the LED state 
static gpio_pin_state_t led_state = GPIO_LOW; 

#elif MANUAL_BLINK_TEST 

// Task definition: MB01 
osThreadId_t MB01Handle; 
const osThreadAttr_t MB01_attributes = 
{
    .name = "MB01", 
    .stack_size = MB_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Board LED blink rate 
static uint32_t mb_ticks = MB_MIN_LED_RATE; 

#elif TASK_SCHEDULING_TEST 

