samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
// Task definition: msg01 
osThreadId_t msg01Handle = NULL; 
const osThreadAttr_t msg01_attributes = 
{
    .name = "msg01", 
    .stack_size = TS_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityBelowNormal 
};

// Task definition: msg02 
osThreadId_t msg02Handle = NULL; 
const osThreadAttr_t msg02_attributes = 
{
    .name = "msg02",
    .stack_size = TS_STACK_SIZE,
    .priority = (osPriority_t) osPriorityNormal 
};

// Strings 
const char msg[] = "Barkadeer brig Arr booty rum"; 

#elif MEMORY_MANAGEMENT_TEST 

// Task definition: MM01 
osThreadId_t MM01Handle; 
const osThreadAttr_t MM01_attributes = 
{
    .name = "MM01", 
    .stack_size = MM_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Pointer used to locate heap allocated memory 
static char *user_msg = NULL; 

#elif QUEUE_TEST 

// Task definition: queue01 
osThreadId_t queue01Handle; 
const osThreadAttr_t queue01_attributes = 
{
    .name = "queue01", 
    .stack_size = QUEUE_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Queue info 
static const uint8_t msg_queue_len = 5; 
static QueueHandle_t msg_queue_0; 
static QueueHandle_t msg_queue_1; 

#elif MUTEX_TEST 

// Task definition: increment01 
osThreadId_t increment01Handle; 
const osThreadAttr_t increment01_attributes = 
{
    .name = "increment01", 
    .stack_size = MUTEX_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Task definition: increment02 
osThreadId_t increment02Handle; 
const osThreadAttr_t increment02_attributes = 
{
    .name = "increment02",
    .stack_size = MUTEX_STACK_SIZE,
    .priority = (osPriority_t) osPriorityBelowNormal 
};

// Shared task counter 
static uint16_t counter_shared = CLEAR; 

// Mutex 
static SemaphoreHandle_t mutex; 

#elif SEMAPHORE_TEST 

// Task definition: increment01 
osThreadId_t semaphoreSetupHandle; 
const osThreadAttr_t semaphoreSetup_attributes = 
{
    .name = "semaphoreSetup", 
    .stack_size = SEMAPHORE_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Semaphores 
static SemaphoreHandle_t binary_sem;   // Allows for parameter copying 
static SemaphoreHandle_t filled_sem;   // Number of filled slots in the circular buffer 
static SemaphoreHandle_t empty_sem;    // Number of empty slots in the circular buffer 

// Mutex 
static SemaphoreHandle_t buff_mutex;   // Protects the circular buffer and serial output 

// Data 
static uint8_t buff[SEMAPHORE_BUFF_SIZE];  // Circular buffer 
static uint8_t write_index = CLEAR;        // Write/head index for circular buffer 
static uint8_t read_index = CLEAR;         // Read/tail index for circular buffer 

#elif SOFTWARE_TIMER_TEST_0 

// Timer(s) - FreeRTOS API method 
static TimerHandle_t one_shot_timer = NULL; 
static TimerHandle_t auto_reload_timer = NULL; 

// Timer(s) - CMSIS API method 
// static osTimerId_t oneShotTimerHandle; 
// const osTimerAttr_t oneShot_attributes = { .name = "oneShotTimer" }; 

#elif SOFTWARE_TIMER_TEST_1 


// Task definition: softwareTimer 
osThreadId_t softwareTimerHandle; 
const osThreadAttr_t softwareTimer_attributes = 
{
    .name = "softwareTimer",
    .stack_size = SOFTWARE_TIMER_STACK_SIZE,
    .priority = (osPriority_t) osPriorityNormal 
};

// Timer(s) 
static TimerHandle_t display_timer = NULL; 

#elif HARDWARE_INTERRUPT_TEST 

// Task definition: hardwareInterrupt01 
osThreadId_t hardwareInterrupt01Handle; 
const osThreadAttr_t hardwareInterrupt01_attributes = 
{
    .name = "hardwareInterrupt01", 
    .stack_size = HARDWARE_INT_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Data 
static double avg = CLEAR; 
static volatile uint16_t adc_result[2][HARDWARE_INT_NUM_SAMPLES]; 
static uint8_t write_index = CLEAR; 
static uint8_t read_index = SET_BIT; 

// Semaphore(s) and Mutex 
static SemaphoreHandle_t binary_sem_0; 
static SemaphoreHandle_t binary_sem_1; 
static SemaphoreHandle_t mutex; 

#elif DEADLOCK_STARVATION_TEST 

// Task definition: increment01 
osThreadId_t deadlockStarvationSetupHandle; 
const osThreadAttr_t deadlockStarvationSetup_attributes = 
{
    .name = "deadlockStarvationSetup", 
    .stack_size = DEADLOCK_STARVATION_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Semaphores 
static SemaphoreHandle_t binary_sem;                    // Wait for params to read 
static SemaphoreHandle_t finish_sem;                    // Notifies main task when done 

// Mutex 
static SemaphoreHandle_t chopstick[NUM_PHILOSOPHERS];   // Chipstick access 
static SemaphoreHandle_t serial_mutex;                  // Serial terminal protection 
static SemaphoreHandle_t arbitrator_mutex;              // Arbitrator chopstick access 

#elif PRIORITY_INVERSION_TEST 

#endif 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: main loop 
 * 
 * @param argument : NULL 
 */
void TaskLoop(void *argument); 

#if PERIODIC_BLINK_TEST 

/**
 * @brief Task function: blink01 
 * 
 * @param argument : NULL 
 */
void TaskBlink01(void *argument); 


/**
 * @brief Task function: blink02 
 * 
 * @param argument : NULL 
 */
void TaskBlink02(void *argument); 


/**
 * @brief LED toggle 
 * 
 * @param ticks : delay between LED toggling (ticks). See notes for info on ticks. 
 */
void blink_led_toggle(uint32_t ticks); 

#elif MANUAL_BLINK_TEST 

/**
 * @brief Task function: MB01 
 * 
 * @param argument : NULL 
 */
void TaskMB01(void *argument); 

#elif TASK_SCHEDULING_TEST 

/**
 * @brief Task function: msg01 
 * 
 * @param argument : NULL 
 */
void TaskMsg01(void *argument); 


/**
 * @brief Task function: msg02 
 * 
 * @param argument : NULL 
 */
void TaskMsg02(void *argument); 

#elif MEMORY_MANAGEMENT_TEST 

/**
 * @brief Task function: MM01 
 * 
 * @param argument : NULL 
 */
void TaskMM01(void *argument); 

#elif QUEUE_TEST 

/**
 * @brief Task function: queue01 
 * 
 * @param argument : NULL 
 */
void TaskQueue01(void *argument); 

