samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
#elif MUTEX_TEST 

/**
 * @brief Task function: increment01 
 * 
 * @param argument : NULL 
 */
void TaskInc01(void *argument); 


/**
 * @brief Task function: increment02 
 * 
 * @param argument : NULL 
 */
void TaskInc02(void *argument); 


/**
 * @brief Increment counter 
 * 
 * @param delay : task delay time (ticks) 
 */
void increment_counter(uint16_t delay); 

#elif SEMAPHORE_TEST 

/**
 * @brief Task function: semaphoreSetup 
 * 
 * @param argument : NULL 
 */
void TaskSemaphoreSetup(void *argument); 


/**
 * @brief Task function: semaphoreProducer 
 * 
 * @param argument : NULL 
 */
void TaskSemaphoreProducer(void *argument); 


/**
 * @brief Task function: semaphoreConsumer 
 * 
 * @param argument : NULL 
 */
void TaskSemaphoreConsumer(void *argument); 

#elif SOFTWARE_TIMER_TEST_0 

/**
 * @brief Called when one of the timers expires 
 * 
 * @param xTimer : software timer ID 
 */
void myTimerCallback(TimerHandle_t xTimer); 

#elif SOFTWARE_TIMER_TEST_1 

/**
 * @brief Task function: softwareTimer 
 * 
 * @param argument : NULL 
 */
void TaskSoftwareTimer(void *argument); 


/**
 * @brief Called when the display sees no activity 
 * 
 * @param argument : NULL 
 */
void DisplayBacklightCallback(TimerHandle_t argument); 

#elif HARDWARE_INTERRUPT_TEST 

/**
 * @brief Task function: hardwareInterrupt 
 * 
 * @param argument : NULL 
 */
void TaskHardwareInterrupt(void *argument); 

#elif DEADLOCK_STARVATION_TEST 

/**
 * @brief Task function: deadlockStarvationSetup 
 * 
 * @param argument : NULL 
 */
void TaskDeadlockStarvationSetup(void *argument); 


/**
 * @brief Task function: philosopherEat 
 * 
 * @param argument : NULL 
 */
void TaskPhilosopherEat(void *argument); 


/**
 * @brief Output philosopher strings to the serial terminal 
 * 
 * @param buff : string to output 
 */
void philosopher_output(char *buff); 

#elif PRIORITY_INVERSION_TEST 

#endif

//=======================================================================================


//=======================================================================================
// Setup code

void freertos_test_init(void)
{
    //==================================================
    // General setup 

    // Initialize GPIO ports 
    gpio_port_init(); 

    // General purpose timer 
    tim_9_to_11_counter_init(
        TIM9, 
        TIM_84MHZ_1US_PSC, 
        0xFFFF,  // Max ARR value 
        TIM_UP_INT_DISABLE); 
    tim_enable(TIM9); 

    // Initialize board LED (on when logic low) 
    gpio_pin_init(GPIOA, PIN_5, MODER_GPO, OTYPER_PP, OSPEEDR_HIGH, PUPDR_NO); 

    // Initialize UART 
    uart_init(
        USART2, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_FRAC_42_9600, 
        UART_MANT_42_9600, 
        UART_DMA_DISABLE, 
        UART_DMA_ENABLE);   // RX DMA enabled for serial terminal reading 
    
    // Enable IDLE line interrupts for reading serial terminal input with DMA 
    uart_interrupt_init(
        USART2, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_ENABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE); 

    // Initialize the DMA stream 
    dma_stream_init(
        DMA1, 
        DMA1_Stream5, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_VHI, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

    // Configure and enable the DMA stream 
    dma_stream_config(
        DMA1_Stream5, 
        (uint32_t)(&USART2->DR), 
        (uint32_t)uart_dma_buff, 
        (uint16_t)SERIAL_INPUT_MAX_LEN); 
    dma_stream_enable(DMA1_Stream5); 

    // Initialize interrupt handler flags and enable the interrupt handler 
    int_handler_init(); 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_0); 

    // Initialize FreeRTOS scheduler 
    osKernelInitialize(); 

    // Create the main loop thread 
    mainLoopHandle = osThreadNew(TaskLoop, NULL, &main_loop_attributes); 

    // Initialize data 
    memset((void *)uart_dma_buff, CLEAR, sizeof(uart_dma_buff)); 
    memset((void *)&buff_index, CLEAR, sizeof(buff_index)); 
    memset((void *)user_in_buff, CLEAR, sizeof(user_in_buff)); 

    //==================================================

#if PERIODIC_BLINK_TEST 

    // Turn the board LED off 
    gpio_write(GPIOA, GPIOX_PIN_5, led_state); 

    // Create the thread(s) 
    blink01Handle = osThreadNew(TaskBlink01, NULL, &blink01_attributes); 
    blink02Handle = osThreadNew(TaskBlink02, NULL, &blink02_attributes); 
    
#elif MANUAL_BLINK_TEST 

    // Create the thread(s) 
    MB01Handle = osThreadNew(TaskMB01, NULL, &MB01_attributes); 

    uart_sendstring(USART2, "\r\n>>> "); 

#elif TASK_SCHEDULING_TEST 

    // Reinitialize UART (serial terminal output) for a slower baud rate 
    uart_init(
        USART2, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_FRAC_42_1200, 
        UART_MANT_42_1200, 
        UART_DMA_DISABLE, 
        UART_DMA_DISABLE); 

    // Create the thread(s) 
    msg01Handle = osThreadNew(TaskMsg01, NULL, &msg01_attributes); 
    msg02Handle = osThreadNew(TaskMsg02, NULL, &msg02_attributes); 

    // Blocking delay to provide time for the user to connect to the serial terminal 
    tim_delay_ms(TIM9, TS_DELAY_4); 

#elif MEMORY_MANAGEMENT_TEST 

    // Create the thread(s) 
    MM01Handle = osThreadNew(TaskMM01, NULL, &MM01_attributes); 
    osThreadSuspend(MM01Handle);   // Suspend to prevent running right away 

    uart_sendstring(USART2, "\r\n>>> "); 

#elif QUEUE_TEST 

    // Create the thread(s) 
    queue01Handle = osThreadNew(TaskQueue01, NULL, &queue01_attributes); 

    // Create queue handle(s) 
    msg_queue_0 = xQueueCreate(msg_queue_len, sizeof(uint32_t)); 
    msg_queue_1 = xQueueCreate(msg_queue_len, sizeof(uint32_t)); 

    uart_sendstring(USART2, "\r\n>>> "); 

