samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
#elif MUTEX_TEST 

    // Create the thread(s) 
    increment01Handle = osThreadNew(TaskInc01, NULL, &increment01_attributes); 
    increment02Handle = osThreadNew(TaskInc02, NULL, &increment02_attributes); 

    // Create the mutex 
    mutex = xSemaphoreCreateMutex(); 

#elif SEMAPHORE_TEST 

    // Create the thread(s) 
    semaphoreSetupHandle = osThreadNew(TaskSemaphoreSetup, NULL, &semaphoreSetup_attributes); 

    // Create semaphore(s) 
    binary_sem = xSemaphoreCreateBinary(); 
    filled_sem = xSemaphoreCreateCounting(SEMAPHORE_BUFF_SIZE, 0); 
    empty_sem = xSemaphoreCreateCounting(SEMAPHORE_BUFF_SIZE, SEMAPHORE_BUFF_SIZE); 

    // Create mutex 
    buff_mutex = xSemaphoreCreateMutex(); 

    // Blocking delay to provide time for the user to connect to the serial terminal 
    tim_delay_ms(TIM9, SEMPAHORE_DELAY_1); 

#elif SOFTWARE_TIMER_TEST_0 

    //==================================================
    // FreeRTOS API method 

    // Create timers 
    one_shot_timer = xTimerCreate(
        "one_shot_timer",               // Name of timer 
        SOFTWARE_TIMER_0_PERIOD_1,      // Period of timer (ticks) 
        pdFALSE,                        // Auto-relead --> pdFASLE == One Shot Timer 
        (void *)0,                      // Timer ID 
        myTimerCallback);               // Callback function 
    
    auto_reload_timer = xTimerCreate(
        "auto_reload_timer",            // Name of timer 
        SOFTWARE_TIMER_0_PERIOD_2,      // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)1,                      // Timer ID 
        myTimerCallback);               // Callback function 

    // Check that the timers were created properly 
    if ((one_shot_timer == NULL) || (auto_reload_timer == NULL))
    {
        uart_sendstring(USART2, "Couldn't create at least one of the timers.\r\n"); 
    }
    else 
    {
        tim_delay_ms(TIM9, SOFTWARE_TIMER_0_DELAY_1); 
        uart_sendstring(USART2, "Starting timers...\r\n"); 

        // Start timers (max block time if command queue is full). 
        // Essentially says to wait forever if the queue is full. 
        xTimerStart(one_shot_timer, portMAX_DELAY); 
        xTimerStart(auto_reload_timer, portMAX_DELAY); 
    }
    
    //==================================================

    //==================================================
    // CMSIS API method 

    // Note that using this function doesn't allow you to adjust the period of the timer. 
    // oneShotTimerHandle = osTimerNew(myTimerCallback, osTimerOnce, NULL, &oneShot_attributes); 
    // osTimerStart(oneShotTimerHandle, 1); 
    
    //==================================================

#elif SOFTWARE_TIMER_TEST_1 

    // Create the thread(s) 
    softwareTimerHandle = osThreadNew(TaskSoftwareTimer, NULL, &softwareTimer_attributes); 

    // Create timer(s) 
    display_timer = xTimerCreate(
        "display_backlight_timer",      // Name of timer 
        SOFTWARE_TIMER_1_PERIOD,        // Period of timer (ticks) 
        pdFALSE,                        // Auto-relead --> pdFASLE == One Shot Timer 
        NULL,                           // Timer ID 
        DisplayBacklightCallback);      // Callback function 

#elif HARDWARE_INTERRUPT_TEST 

    // Re-define timer 9 to be a periodic (counter update) interrupt timer 
    tim_disable(TIM9); 
    tim_9_to_11_counter_init(
        TIM9, 
        TIM_84MHZ_100US_PSC, 
        0x03E8,  // ARR=1000, (1000 counts)*(100us/count) = 100ms 
        TIM_UP_INT_ENABLE); 
    tim_enable(TIM9); 

    // Enable the interrupt handlers. This interrupt calls interrupt safe FreeRTOS API 
    // functions so it has to have a lower (numerically higher) priority than 
    // 'configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY' in 'FreeRTOSConfig.h'. 
    nvic_config(TIM1_BRK_TIM9_IRQn, EXTI_PRIORITY_7); 

    // Initialize the ADC port, pin and read sequence 
    adc1_clock_enable(RCC); 
    adc_port_init(
        ADC1, 
        ADC1_COMMON, 
        ADC_PCLK2_4, 
        ADC_RES_8, 
        ADC_PARAM_ENABLE, 
        ADC_PARAM_ENABLE, 
        ADC_PARAM_DISABLE, 
        ADC_PARAM_DISABLE, 
        ADC_PARAM_DISABLE, 
        ADC_PARAM_DISABLE, 
        ADC_PARAM_DISABLE); 
    adc_pin_init(ADC1, GPIOC, PIN_0, ADC_CHANNEL_10, ADC_SMP_15); 
    adc_seq(ADC1, ADC_CHANNEL_10, ADC_SEQ_1); 
    adc_on(ADC1); 

    // Create the thread(s) 
    hardwareInterrupt01Handle = osThreadNew(
        TaskHardwareInterrupt, NULL, &hardwareInterrupt01_attributes); 

    // Create semaphore(s) and mutex 
    binary_sem_0 = xSemaphoreCreateBinary();   // Indicates when samples can be averaged 
    binary_sem_1 = xSemaphoreCreateBinary();   // Controls double buffer read/write index 
    mutex = xSemaphoreCreateMutex();           // Protects 'avg' 

    // We give the buffer index semaphore immediately to avoid the initial conflict 
    // between updating the double buffer index and averaging the first sample of 10. 
    xSemaphoreGive(binary_sem_1); 

    uart_sendstring(USART2, ">>> "); 

#elif DEADLOCK_STARVATION_TEST 

    // Create the thread(s) 
    deadlockStarvationSetupHandle = osThreadNew(
        TaskDeadlockStarvationSetup, NULL, &deadlockStarvationSetup_attributes); 

    // Create semaphore(s) 
    binary_sem = xSemaphoreCreateBinary(); 
    finish_sem = xSemaphoreCreateCounting(NUM_PHILOSOPHERS, 0); 

    // Create mutex 
    serial_mutex = xSemaphoreCreateMutex(); 
    arbitrator_mutex = xSemaphoreCreateMutex(); 
    
    for (uint8_t i = CLEAR; i < NUM_PHILOSOPHERS; i++)
    {
        chopstick[i] = xSemaphoreCreateMutex(); 
    }

    // Blocking delay to provide time for the user to connect to the serial terminal 
    tim_delay_ms(TIM9, DEADLOCK_STARVATION_DELAY_1); 

#elif PRIORITY_INVERSION_TEST 
    
#endif
} 

//=======================================================================================


//=======================================================================================
// Test code 

