samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
#elif HARDWARE_INTERRUPT_TEST 

        // This interrupt flag will be set when an idle line is detected on UART RX after 
        // receiving new data. 
        if (handler_flags.usart2_flag)
        {
            handler_flags.usart2_flag = CLEAR; 

            // Get the user input from the circular buffer 
            cb_parse(uart_dma_buff, user_in_buff, &buff_index, SERIAL_INPUT_MAX_LEN); 

            // Check for the average command by checking that the input is exactly "avg". 
            if (strlen((char *)user_in_buff) == 3)
            {
                char avg_str[SERIAL_INPUT_MAX_LEN]; 

                if (str_compare("avg", (char *)user_in_buff, BYTE_0))
                {
                    // Display the average and protect 'avg' so it cannot be updated during 
                    // the serial output process. 
                    xSemaphoreTake(mutex, portMAX_DELAY); 
                    snprintf(
                        avg_str, 
                        SERIAL_INPUT_MAX_LEN, 
                        "Average: %u.%u\r\n", 
                        (uint16_t)avg, 
                        (uint16_t)(avg * SCALE_10) % DIVIDE_10); 
                    xSemaphoreGive(mutex); 
                    uart_sendstring(USART2, avg_str); 
                }
            }

            uart_sendstring(USART2, ">>> "); 
        }

#elif DEADLOCK_STARVATION_TEST 
        // Do nothing 
#elif PRIORITY_INVERSION_TEST 

#endif
    }

    osThreadTerminate(NULL); 
}

//=======================================================================================


//=======================================================================================
// Test functions 

#if PERIODIC_BLINK_TEST 

// Task function: blink01 
void TaskBlink01(void *argument)
{
    while (1)
    {
        blink_led_toggle(PB_DELAY_1); 
    }

    osThreadTerminate(NULL); 
}


// Task function: blink02 
void TaskBlink02(void *argument)
{
    while (1)
    { 
        blink_led_toggle(PB_DELAY_2); 
    }

    osThreadTerminate(NULL); 
}


// LED toggle 
void blink_led_toggle(uint32_t ticks)
{
    led_state = GPIO_HIGH - led_state; 
    gpio_write(GPIOA, GPIOX_PIN_5, led_state); 
    osDelay(ticks);   // Delays the specified number of ticks 
}

#elif MANUAL_BLINK_TEST 

// Task function: MB01 
void TaskMB01(void *argument)
{
    // Board LED state 
    gpio_pin_state_t led_state = GPIO_LOW; 

    while (1)
    {
        led_state = GPIO_HIGH - led_state; 
        gpio_write(GPIOA, GPIOX_PIN_5, led_state); 
        osDelay(mb_ticks); 
    }

    osThreadTerminate(NULL); 
}

#elif TASK_SCHEDULING_TEST 

// Task function: msg01 
void TaskMsg01(void *argument)
{
    // Print the string to the terminal one character at a time. 
    while (1)
    {
        uart_send_new_line(USART2); 
        uart_sendstring(USART2, msg); 
        uart_send_new_line(USART2); 
        osDelay(TS_DELAY_2); 
    }

    osThreadTerminate(NULL); 
}


// Task function: msg02 
void TaskMsg02(void *argument)
{
    while (1)
    {
        uart_sendchar(USART2, AST_CHAR); 
        osDelay(TS_DELAY_3); 
    }

    osThreadTerminate(NULL); 
}

#elif MEMORY_MANAGEMENT_TEST 

// Task function: MM01 
void TaskMM01(void *argument)
{
    while (1)
    {
        // Echo the user input back to the serial terminal 
        uart_sendstring(USART2, "Echo: "); 
        uart_sendstring(USART2, user_msg); 
        uart_sendstring(USART2, "\r\n\n>>> "); 

        // Free the heap memory and suspend the task 
        vPortFree(user_msg); 
        user_msg = NULL; 
        osThreadSuspend(MM01Handle); 
    }

    osThreadTerminate(NULL); 
}

#elif QUEUE_TEST 

// Task function: queue01 
void TaskQueue01(void *argument)
{
    uint32_t delay = QUEUE_MIN_LED_RATE, blink_count = CLEAR, blink_tally = CLEAR; 
    gpio_pin_state_t led_state = GPIO_LOW; 

    while (1)
    {
        led_state = GPIO_HIGH - led_state; 
        gpio_write(GPIOA, GPIOX_PIN_5, led_state); 
        blink_count += (uint32_t)led_state; 

        if (blink_count >= 100)
        {
            blink_count = CLEAR; 
            blink_tally++; 
            xQueueSend(msg_queue_1, (void *)&blink_tally, 0); 
        }

        xQueueReceive(msg_queue_0, (void *)&delay, 0); 
        osDelay(delay); 
    }

    osThreadTerminate(NULL); 
}

#elif MUTEX_TEST 

// Task function: increment01 
void TaskInc01(void *argument)
{
    while (1)
    {
        increment_counter(MUTEX_DELAY_1); 
    }

    osThreadTerminate(NULL); 
}


// Task function: increment02 
void TaskInc02(void *argument)
{
    while (1)
    {
        increment_counter(MUTEX_DELAY_2); 
    }

    osThreadTerminate(NULL); 
}


// Increment counter 
void increment_counter(uint16_t delay)
{
    static uint16_t counter_temp = CLEAR; 

    // Take mutex prior to critical section 
    if (xSemaphoreTake(mutex, 0) == pdTRUE)
    {
        // Purposely increment in a non-efficient manner 
        counter_temp = counter_shared; 
        counter_temp++; 
        osDelay(delay); 
        counter_shared = counter_temp; 

        char num_str[SERIAL_INPUT_MAX_LEN]; 
        snprintf(num_str, SERIAL_INPUT_MAX_LEN, "%u\r\n", counter_shared); 
        uart_sendstring(USART2, num_str); 

        // Give mutex back after critical section 
        xSemaphoreGive(mutex); 
    }
    else 
    {
        // Do something useful if the critical section cannot be accessed. 
    }
}

#elif SEMAPHORE_TEST 

// Task function: semaphoreSetup 
void TaskSemaphoreSetup(void *argument)
{
    char task_name[SEMAPHORE_TASK_NAME_LEN]; 

    // Create and start producer threads 
    for (uint8_t i = CLEAR; i < SEMAPHORE_NUM_PRODUCERS; i++)
    {
        snprintf(task_name, SEMAPHORE_TASK_NAME_LEN, "producer-%u", i); 

        const osThreadAttr_t producer_attributes = 
        {
            .name = task_name, 
            .stack_size = SEMAPHORE_STACK_SIZE, 
            .priority = (osPriority_t) osPriorityNormal 
        };

        // Tasks delete themselves after executing the task function 
        osThreadNew(TaskSemaphoreProducer, (void *)&i, &producer_attributes); 

        // Wait for each task to read the argument 
        xSemaphoreTake(binary_sem, portMAX_DELAY); 
    }

    // Create and start consumer threads 
    for (uint8_t i = CLEAR; i < SEMAPHORE_NUM_CONSUMERS; i++)
    {
        snprintf(task_name, SEMAPHORE_TASK_NAME_LEN, "consumer-%i", i); 

        const osThreadAttr_t consumer_attributes = 
        {
            .name = task_name, 
            .stack_size = SEMAPHORE_STACK_SIZE, 
            .priority = (osPriority_t) osPriorityNormal 
        };

        osThreadNew(TaskSemaphoreConsumer, NULL, &consumer_attributes); 
    }

    while (1) {} 

    // Delete the task 
    osThreadTerminate(NULL); 
}


