samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
// Task function: semaphoreProducer 
void TaskSemaphoreProducer(void *argument)
{
    // Copy 'argument' into a local variable 
    uint8_t num = *(uint8_t *)argument; 

    // Release the binary semaphore 
    xSemaphoreGive(binary_sem); 

    // Fill the shared buffer with the task number 3 times 
    for (uint8_t i = CLEAR; i < SEMAPHORE_NUM_WRITES; i++)
    {
        // Critical section 

        xSemaphoreTake(empty_sem, portMAX_DELAY); 
        xSemaphoreTake(buff_mutex, portMAX_DELAY); 

        buff[write_index] = num; 
        write_index = (write_index + 1) % SEMAPHORE_BUFF_SIZE; 

        xSemaphoreGive(buff_mutex); 
        xSemaphoreGive(filled_sem); 
    }

    // Delete the task 
    osThreadTerminate(NULL); 

    // This loop does not execute 
    while (1) {}
}


// Task function: semaphoreConsumer 
void TaskSemaphoreConsumer(void *argument)
{
    uint8_t val; 

    // Read from the buffer 
    while (1)
    {
        // Critical section 

        xSemaphoreTake(filled_sem, portMAX_DELAY); 
        xSemaphoreTake(buff_mutex, portMAX_DELAY); 

        val = buff[read_index]; 
        read_index = (read_index + 1) % SEMAPHORE_BUFF_SIZE; 
        uart_send_integer(USART2, (int16_t)val); 
        uart_send_new_line(USART2); 

        xSemaphoreGive(buff_mutex); 
        xSemaphoreGive(empty_sem); 
    }

    osThreadTerminate(NULL); 
}

#elif SOFTWARE_TIMER_TEST_0 

// Called when one of the timers expires 
void myTimerCallback(TimerHandle_t xTimer)
{
    // The 'xTimer' parameter can be used to identify which timer called this function 
    // when multiple timers call this function. 

    // Print message if timer 0 expired 
    if ((uint32_t)pvTimerGetTimerID(xTimer) == 0)
    {
        uart_sendstring(USART2, "One-shot timer expired.\r\n"); 
    }

    // Print message if timer 1 expired 
    if ((uint32_t)pvTimerGetTimerID(xTimer) == 1)
    {
        uart_sendstring(USART2, "Auto-reload timer expired. Reloading...\r\n"); 
    }
}

#elif SOFTWARE_TIMER_TEST_1 

// Task function: softwareTimer 
void TaskSoftwareTimer(void *argument)
{
    if (display_timer == NULL)
    {
        uart_sendstring(USART2, "Couldn't create timer.\r\n"); 
    }
    else 
    {
        tim_delay_ms(TIM9, SOFTWARE_TIMER_1_DELAY_1); 
        uart_sendstring(USART2, "Starting interface...\r\n>>> "); 

        // Turn the board LED on 
        gpio_write(GPIOA, GPIOX_PIN_5, GPIO_HIGH); 

        // Start timers (max block time if command queue is full). 
        xTimerStart(display_timer, portMAX_DELAY); 
    }

    osThreadTerminate(softwareTimerHandle); 
}


// Called when the display sees no activity 
void DisplayBacklightCallback(TimerHandle_t argument)
{
    // Turn the board LED off 
    gpio_write(GPIOA, GPIOX_PIN_5, GPIO_LOW); 
}

#elif HARDWARE_INTERRUPT_TEST 

// Task function: hardwareInterrupt 
void TaskHardwareInterrupt(void *argument)
{
    while (1)
    {
        // Waits for indication from the ISR that 10 samples have been read before 
        // proceeding to average the samples. 
        xSemaphoreTake(binary_sem_0, portMAX_DELAY); 

        // Compute the average of 10 samples in the part of the double buffer not 
        // being written to by the ISR. 
        uint32_t sum = CLEAR; 
        for (uint8_t i = CLEAR; i < HARDWARE_INT_NUM_SAMPLES; i++)
        {
            sum += (uint32_t)adc_result[read_index][i]; 
        }

        // Allow for read and write section indexes of the double buffer to be updated 
        // in the ISR now that averaging is done. 
        xSemaphoreGive(binary_sem_1); 

        // Protect 'avg' so it can't be used for serial terminal output at the same 
        // time. 
        xSemaphoreTake(mutex, portMAX_DELAY); 
        avg = (double)sum / DIVIDE_10; 
        xSemaphoreGive(mutex); 
        // Could also use vPortEnterCritical and vPortExitCritical here to diable 
        // interrupts for the critical section. 
    }

    osThreadTerminate(NULL); 
}


// Timer 1 break + timer 9 global interrupt - overridden 
void TIM1_BRK_TIM9_IRQHandler(void)
{
    static uint8_t adc_index = CLEAR; 
    BaseType_t task_woken = pdFALSE; 

    // ADC read 
    adc_result[write_index][adc_index++] = adc_read_single(ADC1, ADC_CHANNEL_10); 

    if (adc_index >= HARDWARE_INT_NUM_SAMPLES)
    {
        adc_index = CLEAR; 

        // If averaging is still happening then don't swap the read and write sections 
        // and restart the 10 samples. This can be handled in multiple different ways 
        // such as blocking only one sample at a time. 
        if (xSemaphoreTakeFromISR(binary_sem_1, &task_woken) == pdTRUE)
        {
            read_index = write_index; 
            write_index = SET_BIT - write_index; 
        }
        // Can output a message if data is dropped to help see what's going on. 

        // Give the semaphore to wake up the averaging task (tell it that data is ready). 
        // This sepcial ISR API function will never block since this is not a task. There 
        // are also FreeRTOS ISR functions for directly notifying tasks which could have 
        // been used instead. 
        xSemaphoreGiveFromISR(binary_sem_0, &task_woken); 
    }

    // The following is needed to exit the ISR 
    tim_uif_clear(TIM1); 
    tim_uif_clear(TIM9); 

    // Exit from ISR - if 'task_woken' == 'pdTRUE' then 'portYIELD_FROM_ISR' requests a 
    // context switch to allow a higher priority task to immediately run if it's waiting 
    // on data from this ISR. 
    portYIELD_FROM_ISR(task_woken); 
}

#elif DEADLOCK_STARVATION_TEST 

// Task function: deadlockStarvationSetup 
void TaskDeadlockStarvationSetup(void *argument)
{
    char task_name[DEADLOCK_STARVATION_TASK_NAME_LEN]; 

    // Have philosophers start eating 
    for (uint8_t i = CLEAR; i < NUM_PHILOSOPHERS; i++)
    {
        snprintf(task_name, DEADLOCK_STARVATION_TASK_NAME_LEN, "philosopher-%u", i); 

        const osThreadAttr_t philosopher_attributes = 
        {
            .name = task_name, 
            .stack_size = DEADLOCK_STARVATION_STACK_SIZE, 
            .priority = (osPriority_t) osPriorityNormal 
        };

