samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
        // Tasks delete themselves after executing the task function 
        osThreadNew(TaskPhilosopherEat, (void *)&i, &philosopher_attributes); 

        // Wait for each task to read the argument 
        xSemaphoreTake(binary_sem, portMAX_DELAY); 
    }

    // Wait until all philosophers are done 
    for (uint8_t i = CLEAR; i < NUM_PHILOSOPHERS; i++)
    {
        xSemaphoreTake(finish_sem, portMAX_DELAY); 
    }

    // Indicate that all philosophers ate without deadlock 
    uart_sendstring(USART2, "Done! No deadlock.\r\n"); 

    // Delete the task 
    vTaskDelete(NULL); 
}


// Task function: philosopherEat 
void TaskPhilosopherEat(void *argument)
{
    uint8_t philosopher_num = *(uint8_t *)argument; 
    char buff[PHILOSOPHER_STR_MAX_LEN]; 

    // Increment the sempahore count after the parameter has been copied 
    xSemaphoreGive(binary_sem); 

    //==================================================
    // Arbitrator Method 

    // xSemaphoreTake(arbitrator_mutex, portMAX_DELAY); 
    
    //==================================================

    //==================================================
    // Hierarchy Method (can run with arbitrator method active) 

    uint8_t left_chop = philosopher_num; 
    uint8_t right_chop = (philosopher_num + 1) % NUM_PHILOSOPHERS; 
    uint8_t smallest, largest; 
    
    if (left_chop < right_chop)
    {
        smallest = left_chop; 
        largest = right_chop; 
    }
    else 
    {
        smallest = right_chop; 
        largest = left_chop; 
    }

    // Take the smaller value chopstick 
    xSemaphoreTake(chopstick[smallest], portMAX_DELAY); 
    snprintf(
        buff, 
        PHILOSOPHER_STR_MAX_LEN, 
        "Philosopher %u took chopstick %u\r\n", 
        philosopher_num, 
        philosopher_num); 
    philosopher_output(buff); 

    // Add some delay to force deadlock - this part of the challenge so don't delete it 
    osDelay(1); 

    // Take the largest value chopstick 
    xSemaphoreTake(chopstick[largest], portMAX_DELAY); 
    snprintf(
        buff, 
        PHILOSOPHER_STR_MAX_LEN, 
        "Philosopher %u took chopstick %u\r\n", 
        philosopher_num, 
        (philosopher_num + 1) % NUM_PHILOSOPHERS); 
    philosopher_output(buff); 

    // Eat the noodles 
    snprintf(
        buff, 
        PHILOSOPHER_STR_MAX_LEN, 
        "Philosopher %u is eating\r\n", 
        philosopher_num); 
    philosopher_output(buff); 
    osDelay(10); 

    // Return the largest value chopstick 
    xSemaphoreGive(chopstick[largest]); 
    snprintf(
        buff, 
        PHILOSOPHER_STR_MAX_LEN, 
        "Philosopher %u returned chopstick %u\r\n", 
        philosopher_num, 
        (philosopher_num + 1) % NUM_PHILOSOPHERS); 
    philosopher_output(buff); 

    // Return the smaller value chopstick 
    xSemaphoreGive(chopstick[smallest]); 
    snprintf(
        buff, 
        PHILOSOPHER_STR_MAX_LEN, 
        "Philosopher %u returned chopstick %u\r\n", 
        philosopher_num, 
        philosopher_num); 
    philosopher_output(buff); 
    
    //==================================================

    //==================================================
    // Arbitrator Method 

    // xSemaphoreGive(arbitrator_mutex); 

    //==================================================
    
    // Notify setup task and delete self 
    xSemaphoreGive(finish_sem); 
    vTaskDelete(NULL); 
}


// Output philosopher strings to the serial terminal 
void philosopher_output(char *buff)
{
    xSemaphoreTake(serial_mutex, portMAX_DELAY); 
    uart_sendstring(USART2, buff); 
    xSemaphoreGive(serial_mutex); 
}

#elif PRIORITY_INVERSION_TEST 

#endif

//=======================================================================================
